<font size=6><b> lec03.머신러닝 전처리 : 결측

----
## Feature Engineering
* 전처리(Preprocessing)
* 가공 (Engineering)

### 결측 데이터(Missing Values) 보간,대체,삭제
* 데이터가 NaN일 때 그대로 날려버린다 (complete drop)
* 데이터가 없는 최소의 개수와 같이 규칙을 정해서 날려버린다
* 데이터가 거의 없는 feature는 feature 자체를 날려버린다
* 최빈값, 평균값으로 NaN을 채워버린다
* SMOTE, KNN 같은 모델 학습 후 예측 데이터를 사용해 근사한 값으로 채운다 (가장 과학적인 방법)

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
df = pd.DataFrame({"score": ["A","B","B","A","C"]})
df.head()

  score
0     A
1     B
2     B
3     A
4     C

# 결측 찾기

* DataFrame.isna()
* DataFrame.isnull() : DataFrame.isnull is an alias for DataFrame.isna.
* 결측 : None 또는 np.nan

In [ ]:
df = pd.DataFrame({"name":[None,np.nan,"NaN","allen","king"],"score": ["A","B",np.nan,"A","C"]})
df.head()

    name score
0   None     A
1    NaN     B
2    NaN   NaN
3  allen     A
4   king     C

In [ ]:
df.isna()

    name  score
0   True  False
1   True  False
2  False   True
3  False  False
4  False  False

* 결측 컬럼만 가져오기

In [ ]:
print(df.isna().sum())
print(df.isna().sum()[df.isna().sum()>0].index.values)

name     2
score    1
dtype: int64
['name' 'score']

* 데이터프레임 전체에서 결측이 없는 프레임 찾기

* ~df.isna() 와 df.notna()는 같은 동작을 한다

In [ ]:
~df.isna()

    name  score
0  False   True
1  False   True
2   True  False
3   True   True
4   True   True

In [ ]:
df.notna()

    name  score
0  False   True
1  False   True
2   True  False
3   True   True
4   True   True

* 결측 총 갯수

In [ ]:
df.isna().sum()

name     2
score    1
dtype: int64

* score컬럼에서 결측이 아닌 데이터

In [ ]:
df[~df['score'].isna()]

    name score
0   None     A
1    NaN     B
3  allen     A
4   king     C

In [ ]:
df[df['score'].notna()]

    name score
0   None     A
1    NaN     B
3  allen     A
4   king     C

# 결측채우기

## 지정값 :글자,숫자

* 특정 컬럼의 결측만 'F' 글자로 채우기

In [ ]:
print(df.isna().sum())
df['score'].fillna("F", inplace=True)
df.head()

name     2
score    1
dtype: int64

    name score
0   None     A
1    NaN     B
2    NaN     F
3  allen     A
4   king     C

* 모든 결측을 'F' 글자로 채우기

In [ ]:
df = pd.DataFrame({"name":["smith",np.nan,"jones","allen","king"],"score": ["A","B",np.nan,"A","C"],"le_score": [0,1,np.nan,0,2],"sal": [1000,2000,np.nan,3000,4000]})
df.head()

    name score  le_score     sal
0  smith     A       0.0  1000.0
1    NaN     B       1.0  2000.0
2  jones   NaN       NaN     NaN
3  allen     A       0.0  3000.0
4   king     C       2.0  4000.0

In [ ]:
print(df.isna().sum())
df.fillna("F", inplace=True)
print(df.info())
df.head()

name        1
score       1
le_score    1
sal         1
dtype: int64
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      5 non-null      object
 1   score     5 non-null      object
 2   le_score  5 non-null      object
 3   sal       5 non-null      object
dtypes: object(4)
memory usage: 288.0+ bytes
None

    name score le_score     sal
0  smith     A      0.0  1000.0
1      F     B      1.0  2000.0
2  jones     F        F       F
3  allen     A      0.0  3000.0
4   king     C      2.0  4000.0

* 모든 결측을 100 숫자로 채우기

In [ ]:
df = pd.DataFrame({"name":["smith",np.nan,"jones","allen","king"],"score": ["A","B",np.nan,"A","C"],"le_score": [0,1,np.nan,0,2],"sal": [1000,2000,np.nan,3000,4000]})
df.head()

    name score  le_score     sal
0  smith     A       0.0  1000.0
1    NaN     B       1.0  2000.0
2  jones   NaN       NaN     NaN
3  allen     A       0.0  3000.0
4   king     C       2.0  4000.0

In [ ]:
print(df.isna().sum())
df.fillna(100, inplace=True)
print(df.info())
df.head()

name        1
score       1
le_score    1
sal         1
dtype: int64
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      5 non-null      object
 1   score     5 non-null      object
 2   le_score  5 non-null      float64
 3   sal       5 non-null      float64
dtypes: float64(2), object(2)
memory usage: 288.0+ bytes
None

    name score  le_score     sal
0  smith     A       0.0  1000.0
1    100     B       1.0  2000.0
2  jones   100     100.0   100.0
3  allen     A       0.0  3000.0
4   king     C       2.0  4000.0

## 앞,뒤 행의 값

* 앞의 값으로 채우기

In [ ]:
df = pd.DataFrame({"name":["smith",np.nan,"jones","allen","king"],"score": ["A","B",np.nan,"A","C"],"le_score": [0,1,np.nan,0,2],"sal": [1000,2000,np.nan,3000,4000]})
df.head()

    name score  le_score     sal
0  smith     A       0.0  1000.0
1    NaN     B       1.0  2000.0
2  jones   NaN       NaN     NaN
3  allen     A       0.0  3000.0
4   king     C       2.0  4000.0

In [ ]:
df.fillna(method="ffill", inplace=True) #결측 바로 앞의 레코드 값을 가져와 결측 채우기
df.head()

    name score  le_score     sal
0  smith     A       0.0  1000.0
1  smith     B       1.0  2000.0
2  jones     B       1.0  2000.0
3  allen     A       0.0  3000.0
4   king     C       2.0  4000.0

* 뒤의 값으로 채우기

In [ ]:
df = pd.DataFrame({"name":["smith",np.nan,"jones","allen","king"],"score": ["A","B",np.nan,"A","C"],"le_score": [0,1,np.nan,0,2],"sal": [1000,2000,np.nan,3000,4000]})
df.head()

    name score  le_score     sal
0  smith     A       0.0  1000.0
1    NaN     B       1.0  2000.0
2  jones   NaN       NaN     NaN
3  allen     A       0.0  3000.0
4   king     C       2.0  4000.0

In [ ]:
df.fillna(method="bfill", inplace=True) #결측 바로 앞의 레코드 값을 가져와 결측 채우기
df.head()

    name score  le_score     sal
0  smith     A       0.0  1000.0
1  jones     B       1.0  2000.0
2  jones     A       0.0  3000.0
3  allen     A       0.0  3000.0
4   king     C       2.0  4000.0

## 컬럼마다 다르게 지정

* 컬럼마다 사전 정의한 값으로 채우기

In [ ]:
df = pd.DataFrame({"name":["smith",np.nan,"jones","allen","king"],"score": ["A","B",np.nan,"A","C"],"le_score": [0,1,np.nan,0,2],"sal": [1000,2000,np.nan,3000,4000]})
df.head()

    name score  le_score     sal
0  smith     A       0.0  1000.0
1    NaN     B       1.0  2000.0
2  jones   NaN       NaN     NaN
3  allen     A       0.0  3000.0
4   king     C       2.0  4000.0

In [ ]:
dic = {"name": "아무개", "score": "F", "le_score": 0, "sal": 5555}
df.fillna(value=dic, inplace=True)
df.head()

    name score  le_score     sal
0  smith     A       0.0  1000.0
1    아무개     B       1.0  2000.0
2  jones     F       0.0  5555.0
3  allen     A       0.0  3000.0
4   king     C       2.0  4000.0

## 중앙값(Median)
* 데이터 개수에 대해 절반으로 나누는 위치의 값
* 개수가 짝수일 땐 중간에 위치한 두 값의 평균
* 중앙값은 모든 관측값을 이용하지 않으므로 평균값보단 이상치(아웃라이어)의 영향을 덜 받는다.

In [ ]:
df = pd.DataFrame({"name":["smith","martin","jones","allen","king"],"score": ["A","B",np.nan,"A","C"],"le_score": [0,1,np.nan,0,2],"sal": [1000,2000,np.nan,3000,4000]})
df.head()

     name score  le_score     sal
0   smith     A       0.0  1000.0
1  martin     B       1.0  2000.0
2   jones   NaN       NaN     NaN
3   allen     A       0.0  3000.0
4    king     C       2.0  4000.0

* 결측 컬럼만 가져오기

In [ ]:
print(df.isna().sum())
print(df.isna().sum()[df.isna().sum()>0].index.values)

name        0
score       1
le_score    1
sal         1
dtype: int64
['score' 'le_score' 'sal']

* 중앙값(Median) 채우기는 글자 컬럼은 에러

In [ ]:
df = pd.DataFrame({"name":["smith","martin","jones","allen","king"],"score": ["A","B",np.nan,"A","C"],"le_score": [0,1,np.nan,0,2],"sal": [1000,2000,np.nan,3000,4000]})
df.head()

     name score  le_score     sal
0   smith     A       0.0  1000.0
1  martin     B       1.0  2000.0
2   jones   NaN       NaN     NaN
3   allen     A       0.0  3000.0
4    king     C       2.0  4000.0

In [ ]:
print(df['sal'].median())
df.loc[df['sal'].isnull(), 'sal'] = df['sal'].median()
df.head()

2500.0

     name score  le_score     sal
0   smith     A       0.0  1000.0
1  martin     B       1.0  2000.0
2   jones   NaN       NaN  2500.0
3   allen     A       0.0  3000.0
4    king     C       2.0  4000.0

In [ ]:
print(df['sal'].median())
df.loc[df['sal'].isnull(), ['le_score','sal']] = df['sal'].median()
df.head()

2500.0

     name score  le_score     sal
0   smith     A       0.0  1000.0
1  martin     B       1.0  2000.0
2   jones   NaN       NaN  2500.0
3   allen     A       0.0  3000.0
4    king     C       2.0  4000.0

## 그룹평균값

<img src="https://t1.daumcdn.net/cfile/tistory/99C9CB455C1A3D7C31">

In [ ]:
df = pd.DataFrame({"name":["smith","martin","jones","allen","king"],"score": ["A","B","B","A","C"],"le_score": [0,1,1,0,2],"sal": [1000,2000,np.nan,3000,4000]})
df.head()

     name score  le_score     sal
0   smith     A         0  1000.0
1  martin     B         1  2000.0
2   jones     B         1     NaN
3   allen     A         0  3000.0
4    king     C         2  4000.0

In [ ]:
df.groupby("score").sal.mean()

score
A    2000.0
B    2000.0
C    4000.0
Name: sal, dtype: float64

* apply(lambda) 비추

In [ ]:
df = df.groupby("score").apply(lambda g: g.fillna(g.mean()))
df.head()

C:\Users\677\AppData\Local\Temp\ipykernel_22012\4268829977.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df = df.groupby("score").apply(lambda g: g.fillna(g.mean()))

     name score  le_score     sal
0   smith     A         0  1000.0
1  martin     B         1  2000.0
2   jones     B         1  2000.0
3   allen     A         0  3000.0
4    king     C         2  4000.0

* <font color=red size=3><b> ★★★ 주의주의 : 특정 컬럼을 지목하면 에러

In [ ]:
## df          = df.groupby("score").apply(lambda g: g.fillna(g.mean()))   #-----------정상:deprecated(Select only valid columns before calling the reduction.)
# df["score"] = df.groupby("score").apply(lambda g: g.fillna(g.mean()))  #------------에러
# df.head()

* transform(lambda) 추천

In [ ]:
df = pd.DataFrame({"name":["smith","martin","jones","allen","king"],"score": ["A","B","B","A","C"],"le_score": [0,1,1,0,2],"sal": [1000,2000,np.nan,3000,4000]})
df.head()

     name score  le_score     sal
0   smith     A         0  1000.0
1  martin     B         1  2000.0
2   jones     B         1     NaN
3   allen     A         0  3000.0
4    king     C         2  4000.0

In [ ]:
df.groupby('score')['sal'].size()

score
A    2
B    2
C    1
Name: sal, dtype: int64

* <font color=red size=3><b> ★★★ 그룹의 평균값으로 결측 채우기

In [ ]:
# df["score"] = df.groupby("score").apply(lambda g: g.fillna(g.mean()))      #----------- 에러
# df["score"] = df.groupby("score").transform(lambda g: g.fillna(g.mean()))  #----------- 에러

df['sal'] = df.groupby('score')['sal'].transform(lambda g: g.fillna(g.mean()))
df.head()

     name score  le_score     sal
0   smith     A         0  1000.0
1  martin     B         1  2000.0
2   jones     B         1  2000.0
3   allen     A         0  3000.0
4    king     C         2  4000.0

## 최빈도
* 범주형 변수에서 가장 자주 등장하는 값
* object 자료형의 컬럼에서 결측값을 최빈값으로 대체하는 개념

In [ ]:
df = pd.DataFrame({"name":["smith","martin","jones","allen","king"],"score": ["A","A","B","A","C"],"le_score": [0,1,1,0,2],"sal": [1000,2000,np.nan,3000,4000]})
df.head()

     name score  le_score     sal
0   smith     A         0  1000.0
1  martin     A         1  2000.0
2   jones     B         1     NaN
3   allen     A         0  3000.0
4    king     C         2  4000.0

In [ ]:
df["score"].mode()

0    A
Name: score, dtype: object

In [ ]:
df["score"].mode()[0]

'A'

In [ ]:
df['sal'].fillna(df["score"].mode()[0], inplace=True)
df.head()

     name score  le_score     sal
0   smith     A         0  1000.0
1  martin     A         1  2000.0
2   jones     B         1       A
3   allen     A         0  3000.0
4    king     C         2  4000.0

## 반복문 채우기

In [ ]:
df = pd.DataFrame({"name":["smith","martin","jones","allen","king"],"score": ["A","B",np.nan,"A","C"],"le_score": [0,1,np.nan,0,2],"sal": [1000,2000,np.nan,3000,4000]})
df.head()

     name score  le_score     sal
0   smith     A       0.0  1000.0
1  martin     B       1.0  2000.0
2   jones   NaN       NaN     NaN
3   allen     A       0.0  3000.0
4    king     C       2.0  4000.0

In [ ]:
col_list = ['le_score', 'sal']
for col in col_list:
    print( df[col].median())
    df.loc[df[col].isnull(), col] = df[col].median()
df.head()

0.5
2500.0

     name score  le_score     sal
0   smith     A       0.0  1000.0
1  martin     B       1.0  2000.0
2   jones   NaN       0.5  2500.0
3   allen     A       0.0  3000.0
4    king     C       2.0  4000.0

* 가로줄 결측 채우기

In [ ]:
df = pd.DataFrame({"name":["smith",np.nan,"jones","allen","king"],"score": ["A","B",np.nan,"A","C"],"le_score": [0,1,np.nan,0,2],"sal": [1000,2000,np.nan,3000,4000]})
df.head()

    name score  le_score     sal
0  smith     A       0.0  1000.0
1    NaN     B       1.0  2000.0
2  jones   NaN       NaN     NaN
3  allen     A       0.0  3000.0
4   king     C       2.0  4000.0

# 결측지우기

* 모든 행에 대해 최소 하나의 컬럼이라도 결측 있으면 행 삭제

In [ ]:
df = pd.DataFrame({"name":["smith",np.nan,"jones","allen","king"],"score": ["A","B",np.nan,"A","C"],"le_score": [0,1,np.nan,0,2],"sal": [1000,2000,np.nan,3000,4000]})
df.head()

    name score  le_score     sal
0  smith     A       0.0  1000.0
1    NaN     B       1.0  2000.0
2  jones   NaN       NaN     NaN
3  allen     A       0.0  3000.0
4   king     C       2.0  4000.0

In [ ]:
df.dropna(inplace=True)
df.head()

    name score  le_score     sal
0  smith     A       0.0  1000.0
3  allen     A       0.0  3000.0
4   king     C       2.0  4000.0

*  how='all' : 모든 행에 대해 모든 컬럼이 결측이면 행 삭제

In [ ]:
df = pd.DataFrame({"name":["smith",'martin',np.nan,"allen","king"],"score": ["A","B",np.nan,"A","C"],"le_score": [0,1,np.nan,0,2],"sal": [1000,2000,np.nan,3000,4000]})
df.head()

     name score  le_score     sal
0   smith     A       0.0  1000.0
1  martin     B       1.0  2000.0
2     NaN   NaN       NaN     NaN
3   allen     A       0.0  3000.0
4    king     C       2.0  4000.0

In [ ]:
df.dropna(how='all', inplace=True)
df.head()

     name score  le_score     sal
0   smith     A       0.0  1000.0
1  martin     B       1.0  2000.0
3   allen     A       0.0  3000.0
4    king     C       2.0  4000.0

* how='any' : 모든 행에 대해 모든 컬럼마다 한개의 결측이라도 있으면 행 삭제

In [ ]:
df = pd.DataFrame({"name":["smith",np.nan,"smith","allen","king"],"score": ["A","B",np.nan,"A","C"],"le_score": [0,1,np.nan,0,2],"sal": [1000,2000,np.nan,3000,4000]})
df.head()

    name score  le_score     sal
0  smith     A       0.0  1000.0
1    NaN     B       1.0  2000.0
2  smith   NaN       NaN     NaN
3  allen     A       0.0  3000.0
4   king     C       2.0  4000.0

In [ ]:
df.dropna(how='all', inplace=True)
df.head()

    name score  le_score     sal
0  smith     A       0.0  1000.0
1    NaN     B       1.0  2000.0
2  smith   NaN       NaN     NaN
3  allen     A       0.0  3000.0
4   king     C       2.0  4000.0

In [ ]:
df.dropna(how='any', inplace=True)
df.head()

    name score  le_score     sal
0  smith     A       0.0  1000.0
3  allen     A       0.0  3000.0
4   king     C       2.0  4000.0

* 각 행에 대해 최소 2개의 결측이 보이면 삭제

In [ ]:
df = pd.DataFrame({"name":["smith",np.nan,"smith","allen","king"],"score": ["A","B",np.nan,"A","C"],"le_score": [0,1,np.nan,0,2],"sal": [1000,2000,np.nan,3000,4000]})
df.head()

    name score  le_score     sal
0  smith     A       0.0  1000.0
1    NaN     B       1.0  2000.0
2  smith   NaN       NaN     NaN
3  allen     A       0.0  3000.0
4   king     C       2.0  4000.0

In [ ]:
df.dropna(thresh=2, inplace=True)
df.head()

    name score  le_score     sal
0  smith     A       0.0  1000.0
1    NaN     B       1.0  2000.0
3  allen     A       0.0  3000.0
4   king     C       2.0  4000.0

* 모든 컬럼마다 한개의 결측이라도 있으면 컬럼 삭제

In [ ]:
df = pd.DataFrame({"name":["smith",'martin',"jones","allen","king"],"score": ["A","B",np.nan,"A","C"],"le_score": [0,1,np.nan,0,2],"sal": [1000,2000,2500,3000,4000]})
df.head()

     name score  le_score   sal
0   smith     A       0.0  1000
1  martin     B       1.0  2000
2   jones   NaN       NaN  2500
3   allen     A       0.0  3000
4    king     C       2.0  4000

In [ ]:
df.dropna(axis='columns', inplace=True)
df.head()

     name   sal
0   smith  1000
1  martin  2000
2   jones  2500
3   allen  3000
4    king  4000